#SQL With Pandas
A notebook for doing some SQL examples of matrix operations with pandas. Keep it nice and simple.

In [1]:
import pandas as pd
import numpy as np
import pandasql

In [2]:
np.random.seed(4)

Suppose you had two matrices, A and B. For the sake of argument let's say they're both square matrices of size 5. Use  SQL syntax to represent them in a database and perform matrix multiplication.

In [3]:
## Set up two 5x5 matrices
data_dict = {"row":[0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 4, 4, 4, 4, 4,
                    0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 4, 4, 4, 4, 4], 
             "col":[0, 1, 2, 3, 4, 0, 1, 2, 3, 4, 0, 1, 2, 3, 4, 0, 1, 2, 3, 4, 0, 1, 2, 3, 4,
                    0, 1, 2, 3, 4, 0, 1, 2, 3, 4, 0, 1, 2, 3, 4, 0, 1, 2, 3, 4, 0, 1, 2, 3, 4], 
             "val":np.random.randint(10, size=50), 
             "matrix":["A","A","A","A","A","A","A","A","A","A","A","A","A","A","A","A","A","A","A","A","A","A","A","A","A",
                       "B","B","B","B","B","B","B","B","B","B","B","B","B","B","B","B","B","B","B","B","B","B","B","B","B"]}

In [4]:
data_df = pd.DataFrame(data_dict)

## Matrix Addition/Subtraction Operations
$$
\mathbf{A} \pm \mathbf{B} = \{ A_{ij} \pm B_{ij}\}_{i,j}^{M,N}
$$
For $i$ in $M$ rows and $j$ in $N$ columns

In [5]:
the_query = "SELECT A.row, A.col, A.val + B.val"
the_query += " FROM data_df as A, data_df as B"
the_query += " WHERE A.matrix = 'A' AND B.matrix = 'B'"
the_query += " AND A.row = B.row AND A.col = B.col"
the_query += " LIMIT 10;"
pandasql.sqldf(the_query, locals())

   row  col  A.val + B.val
0    0    0             15
1    0    1              7
2    0    2              6
3    0    3             16
4    0    4              8
5    1    0             10
6    1    1              9
7    1    2              9
8    1    3             15
9    1    4             10

In [6]:
M_a = np.matrix(data_dict["val"][:25]).reshape((5,5))
M_b = np.matrix(data_dict["val"][25:]).reshape((5,5))

In [7]:
M_a + M_b

matrix([[15,  7,  6, 16,  8],
        [10,  9,  9, 15, 10],
        [ 8,  9, 11,  6,  5],
        [ 8, 13,  5,  1,  7],
        [ 6, 14, 18,  6, 13]])

## Matrix Dot Product
For matrices **A** and **B**, 
$$\mathbf{A} = \begin{bmatrix} 
a_{11} & a_{12}\\
a_{21} & a_{22}\\
\end{bmatrix}$$

$$\mathbf{B} = \begin{bmatrix} 
b_{11} & b_{12}\\
b_{21} & b_{22}\\
\end{bmatrix}$$

\begin{align}
\mathbf{dot}(\mathbf{A},\mathbf{B}) &=& \mathbf{A}\cdot\mathbf{B} = \begin{bmatrix} 
a_{11}\cdot b_{11} + a_{12}\cdot b_{21} & a_{11}\cdot b_{12} + a_{12}\cdot b_{22} \\
a_{21}\cdot b_{11} + a_{22}\cdot b_{21} & a_{21}\cdot b_{12} + a_{22}\cdot b_{22} \\
\end{bmatrix}
\end{align}

In [8]:
the_query = "SELECT A.row, B.col, SUM(A.val * B.val)"
the_query += " FROM data_df as A, data_df as B"
the_query += " WHERE A.matrix = 'A' AND B.matrix = 'B'"
the_query += " AND A.col = B.row"
the_query += " GROUP BY A.row, B.col"
the_query += " LIMIT 10;"
pandasql.sqldf(the_query, locals())

   row  col  SUM(A.val * B.val)
0    0    0                  90
1    0    1                 184
2    0    2                 117
3    0    3                 106
4    0    4                  74
5    1    0                  98
6    1    1                 156
7    1    2                 144
8    1    3                 105
9    1    4                  90

In [9]:
np.dot(M_a, M_b)

matrix([[ 90, 184, 117, 106,  74],
        [ 98, 156, 144, 105,  90],
        [ 92, 131,  85, 148,  72],
        [ 66, 103, 102,  86,  76],
        [ 77, 153, 118, 104,  89]])

# Practice Questions from ProgrammerInterview.Com

In [10]:
salesperson = pd.DataFrame({
        "salesID" : [1,2,5,7,8,11],
        "Name" : ["Abe","Bob","Chris","Dan","Ken","Joe"],
        "Age" : [61,34,34,41,57,38],
        "Salary" : [140000,44000,40000,52000,115000,38000]
    })

customer = pd.DataFrame({
        "custID" : [4,6,7,9],
        "Name" : ["Samsonic", "Panasung", "Samony", "Orange"],
        "City" : ["pleasant", "oaktown", "jackson", "jackson"],
        "IndustryType" : ["J","J","B","B"]
    })

orders = pd.DataFrame({
        "Number" : [10,20,30,40,50,60,70],
        "order_date" : ["8/2/96", "1/30/99", "7/14/95", "1/29/98", "2/3/98", "3/2/98", "5/6/98"],
        "cust_id" : [4,4,9,7,6,6,9],
        "salesperson_id" : [2,8,1,2,7,7,7],
        "Amount" : [540,1800,460,2400,600,720,150]
    })

Find the names of all salespeople that have an order with "Samsonic".

In [11]:
the_query = "SELECT sales.Name"
the_query += " FROM salesperson AS sales"
the_query += " JOIN orders AS ord"
the_query += " ON sales.salesID = ord.salesperson_id"
the_query += " JOIN customer AS cust"
the_query += " ON cust.custID = ord.cust_id"
the_query += " WHERE cust.Name = 'Samsonic'"
pandasql.sqldf(the_query, locals())

  Name
0  Bob
1  Ken

Find the names of all salespeople that do not have any order with Samsonic

In [12]:
the_query = "SELECT DISTINCT sales.Name"
the_query += " FROM salesperson AS sales"
the_query += " JOIN orders AS ord"
the_query += " ON sales.salesID = ord.salesperson_id"
the_query += " JOIN customer AS cust"
the_query += " ON cust.custID = ord.cust_id"
the_query += " WHERE cust.Name NOT LIKE 'Samsonic'"
pandasql.sqldf(the_query, locals())

  Name
0  Dan
1  Bob
2  Abe

Find the names of salespeople that have 2 or more orders

In [13]:
the_query = "SELECT sales.Name"
the_query += " FROM salesperson AS sales"
the_query += " JOIN orders AS ord"
the_query += " ON sales.salesID = ord.salesperson_id"
the_query += " GROUP BY sales.Name"
the_query += " HAVING COUNT(sales.Name) >= 2"
pandasql.sqldf(the_query, locals())

  Name
0  Bob
1  Dan

Create a new table called highAchiever(Name, Age), where a salesperson must have a salary of 100,000 or greater to be included in the table

In [14]:
the_query = "SELECT Name, Age"
the_query += " FROM salesperson"
the_query += " WHERE salary > 100000"
high_achiever = pandasql.sqldf(the_query, locals())

In [15]:
high_achiever

  Name  Age
0  Abe   61
1  Ken   57

Retrieve the names of all salespeople that have more than 1 order from the tables

In [16]:
the_query = "SELECT s.Name"
the_query += " FROM salesperson AS s"
the_query += " JOIN orders AS o"
the_query += " ON s.salesID = o.salesperson_id"
the_query += " GROUP BY s.Name"
the_query += " HAVING COUNT(o.salesperson_id) > 1"
pandasql.sqldf(the_query, locals())

  Name
0  Bob
1  Dan

Find the largest order amount for each salesperson and the associated order number, along with the customer to whom that order belongs to.

In [17]:
the_query = "SELECT s.Name, salesperson_id, Number as OrderNum, Amount"
the_query += " FROM orders"
the_query += " JOIN"
the_query += " (SELECT salesperson_id, MAX(Amount) AS MaxOrder"
the_query += " FROM orders"
the_query += " GROUP BY salesperson_id) AS TopOrderAmountsPerSalesperson"
the_query += " USING (salesperson_id)"
the_query += " JOIN salesperson AS s ON s.salesID = orders.salesperson_id"
the_query += " WHERE Amount = MaxOrder"

pandasql.sqldf(the_query, locals())

  Name  salesperson_id  OrderNum  Amount
0  Abe               1        30     460
1  Bob               2        40    2400
2  Dan               7        60     720
3  Ken               8        20    1800

Questions without data in DBs: Given 2 tables:

**User**
- user_id
- name
- phone_num

**UserHistory**
- user_id
- date
- action

Every time a user logs in a new row is inserted into the UserHistory table with user_id, current date, and action.

1. Write a SQL query that returns the name, phone number and most recent date for any user that has logged in over the last 30 days (you can tell a user has logged in if the action field in UserHistory is set to "logged_on").

2. Write a SQL query to determine which user_ids in the User table are not contained in the UserHistory table (assume the UserHistory table has a subset of the user_ids in User table). Do not use the SQL MINUS statement.

You should avoid using subqueries.

In [18]:
#Solution 1
the_query = "SELECT User.name, User.phone_num, max(UserHistory.date)"
the_query += " FROM User"
the_query += " JOIN UserHistory"
the_query += " ON User.user_id = UserHistory.user_id"
the_query += " WHERE UserHistory.date >= DATE_SUB(CURDATE(), INTERVAL 30 DAY)"
the_query += " AND UserHistory.action = 'logged_on'"
the_query += " GROUP BY (User.user_id)"

print the_query

SELECT User.name, User.phone_num, max(UserHistory.date) FROM User JOIN UserHistory ON User.user_id = UserHistory.user_id WHERE UserHistory.date >= DATE_SUB(CURDATE(), INTERVAL 30 DAY) AND UserHistory.action = 'logged_on' GROUP BY (User.user_id)

In [19]:
#Solution 2
the_query = "SELECT DISTINCT u.user_id"
the_query += " FROM User AS u"
the_query += " LEFT JOIN UserHistory AS uh"
the_query += " ON u.user_id = uh.user_id"
the_query += " WHERE uh.user_id IS NULL"

print the_query

SELECT DISTINCT u.user_id FROM User AS u LEFT JOIN UserHistory AS uh ON u.user_id = uh.user_id WHERE uh.user_id IS NULL